hardware/ultrasonic_anemometer/sim/openfoam/matrix/anemometer_u5_yaw45/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-1.0 -1.0 -0.8)
    ( 2.0 -1.0 -0.8)
    ( 2.0  1.0 -0.8)
    (-1.0  1.0 -0.8)
    (-1.0 -1.0  1.0)
    ( 2.0 -1.0  1.0)
    ( 2.0  1.0  1.0)
    (-1.0  1.0  1.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (90 60 54) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);
